---
title: ConnectorManager
classe: Autodesk.Revit.DB.ConnectorManager
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ConnectorManager

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ConnectorSet Connectors { get; }` | `connectorManager.Connectors` | ConnectorSet |
| `Boolean IsValidObject { get; }` | `connectorManager.IsValidObject` | Boolean |
| `Element Owner { get; }` | `connectorManager.Owner` | Element |
| `ConnectorSet UnusedConnectors { get; }` | `connectorManager.UnusedConnectors` | ConnectorSet |
| `Void Dispose()` | `connectorManager.Dispose()` | Void |
| `Connector Lookup(Int32)` | `connectorManager.Lookup(index)` | Connector |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```